saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.EFM32TGxxx_DFP.1.4.0.pdsc
        <!-- *************************  Device 'EFM32TG210F32'  ***************************** -->
        <device Dname="EFM32TG210F32">
          <compile header="Device/EFM32TG/Include/em_device.h" define="EFM32TG210F32"/>
          <debug svd="SVD/EFM32TG/EFM32TG210F32.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32.FLM" start="0x00000000" size="0x00008000"             default="1"/>
        </device>

        <!-- *************************  Device 'EFM32TG210F16'  ***************************** -->
        <device Dname="EFM32TG210F16">
          <compile header="Device/EFM32TG/Include/em_device.h" define="EFM32TG210F16"/>
          <debug svd="SVD/EFM32TG/EFM32TG210F16.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32.FLM" start="0x00000000" size="0x00004000"             default="1"/>
        </device>

        <!-- *************************  Device 'EFM32TG210F8'  ***************************** -->
        <device Dname="EFM32TG210F8">
          <compile header="Device/EFM32TG/Include/em_device.h" define="EFM32TG210F8"/>
          <debug svd="SVD/EFM32TG/EFM32TG210F8.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32.FLM" start="0x00000000" size="0x00002000"             default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32TG110'  **************************** -->
      <subFamily DsubFamily="EFM32TG110">
        <feature type="AnalogOther"   n="3"                           name="Operational Amplifier"/>
        <feature type="IOs"           n="17"                          name="General Purpose I/O pins"/>
        <feature type="Crypto"        n="1"                           name="Hardware AES with 128/256-bit keys in 54/75 cycles"/>
        <feature type="ADC"           n="1"       m="12"              name="12-bit 1 Msamples/s Analog to Digital Converter"/>

        <book name="Documents/EFM32TG110.pdf" title="EFM32TG110 Data Sheet"/>

        <!-- *************************  Device 'EFM32TG110F32'  ***************************** -->
        <device Dname="EFM32TG110F32">
          <compile header="Device/EFM32TG/Include/em_device.h" define="EFM32TG110F32"/>
          <debug svd="SVD/EFM32TG/EFM32TG110F32.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32.FLM" start="0x00000000" size="0x00008000"             default="1"/>
        </device>

        <!-- *************************  Device 'EFM32TG110F16'  ***************************** -->
        <device Dname="EFM32TG110F16">
          <compile header="Device/EFM32TG/Include/em_device.h" define="EFM32TG110F16"/>
          <debug svd="SVD/EFM32TG/EFM32TG110F16.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32.FLM" start="0x00000000" size="0x00004000"             default="1"/>
        </device>

        <!-- *************************  Device 'EFM32TG110F8'  ***************************** -->
        <device Dname="EFM32TG110F8">
          <compile header="Device/EFM32TG/Include/em_device.h" define="EFM32TG110F8"/>
          <debug svd="SVD/EFM32TG/EFM32TG110F8.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32.FLM" start="0x00000000" size="0x00002000"             default="1"/>
        </device>

        <!-- *************************  Device 'EFM32TG110F4'  ***************************** -->
        <device Dname="EFM32TG110F4">
          <compile header="Device/EFM32TG/Include/em_device.h" define="EFM32TG110F4"/>
          <debug svd="SVD/EFM32TG/EFM32TG110F4.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00001000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32.FLM" start="0x00000000" size="0x00001000"             default="1"/>

          <feature type="USBD"          n="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32TG108'  **************************** -->
      <subFamily DsubFamily="EFM32TG108">
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="17"                          name="General Purpose I/O pins"/>

        <book name="Documents/EFM32TG108.pdf" title="EFM32TG108 Data Sheet"/>

        <!-- *************************  Device 'EFM32TG108F32'  ***************************** -->
        <device Dname="EFM32TG108F32">
          <compile header="Device/EFM32TG/Include/em_device.h" define="EFM32TG108F32"/>
          <debug svd="SVD/EFM32TG/EFM32TG108F32.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32.FLM" start="0x00000000" size="0x00008000"             default="1"/>
        </device>

        <!-- *************************  Device 'EFM32TG108F16'  ***************************** -->
        <device Dname="EFM32TG108F16">
          <compile header="Device/EFM32TG/Include/em_device.h" define="EFM32TG108F16"/>
          <debug svd="SVD/EFM32TG/EFM32TG108F16.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32.FLM" start="0x00000000" size="0x00004000"             default="1"/>
        </device>

        <!-- *************************  Device 'EFM32TG108F8'  ***************************** -->
        <device Dname="EFM32TG108F8">
          <compile header="Device/EFM32TG/Include/em_device.h" define="EFM32TG108F8"/>
          <debug svd="SVD/EFM32TG/EFM32TG108F8.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32.FLM" start="0x00000000" size="0x00002000"             default="1"/>
        </device>

        <!-- *************************  Device 'EFM32TG108F4'  ***************************** -->
        <device Dname="EFM32TG108F4">
          <compile header="Device/EFM32TG/Include/em_device.h" define="EFM32TG108F4"/>
          <debug svd="SVD/EFM32TG/EFM32TG108F4.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00001000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32.FLM" start="0x00000000" size="0x00001000"             default="1"/>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="Compiler GCC">
      <require Tcompiler="GCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="EFM32TG">
      <description>Silicon Labs EFM32TG device series</description>
      <require Dvendor="Silicon Labs:21" Dname="EFM32TG*"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="EFM32TG CMSIS">
      <description>Silicon Labs EFM32TG devices, CMSIS Core</description>
      <require condition="EFM32TG"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <!-- Device + CMSIS + Compiler Conditions -->
    <condition id="EFM32TG CMSIS GCC">
      <description>Silicon Labs EFM32TG devices, CMSIS Core, GCC compiler</description>
      <require condition="EFM32TG CMSIS"/>
      <require condition="Compiler GCC"/>
    </condition>

    <!-- emlib Conditions -->
    <condition id="emlib Framework">
      <description>Silicon Labs emlib Framework</description>
      <require condition="EFM32TG"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
    </condition>
    <condition id="emlib SYSTEM">
      <description>Silicon Labs emlib with SYSTEM</description>
      <require condition="EFM32TG"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="SYSTEM"/>
    </condition>
